In [1]:
import pandas as pd
import numpy as np

In [12]:
svi = pd.read_csv("./data/CDC/xn--CDCs_Social_Vulnerability_Index_(SVI)__2014_overall_SVI,_census_tract_level_-_Wake_County-7470.csv")

In [2]:
cleaned_svi = pd.read_csv("./data/CDC/svi_cleaned.csv")

In [3]:
cleaned_svi.head()

       COUNTY  E_TOTPOP   Product
0   Abbeville     25100   49679.0
1      Acadia     62031  110194.0
2    Accomack     33162   45829.0
3         Ada    409239  197684.0
4       Adair     74597   79896.0

In [7]:
dic = {}
for column in cleaned_svi.columns.to_list():
    if column != "COUNTY":
        ls = cleaned_svi[column].to_numpy()
        print(ls)
        quantile = []
        for i in range(1, 11):
            quantile.append(np.quantile(ls, i/10))
        dic[column] = quantile

[25100 62031 33162 ... 12013  2837  4585]
[ 49679. 110194.  45829. ...  68525.  19859.   9170.]

In [8]:
svi_quantile = pd.DataFrame(dic)

In [9]:
svi_quantile

    E_TOTPOP     Product
0     5749.0      3028.0
1    10662.0      7801.0
2    17204.0     14510.0
3    25334.0     25079.0
4    38312.0     38352.0
5    59033.0     57910.0
6    93843.0     93489.0
7   171488.0    172172.0
8   408016.0    397911.0
9  9974179.0  30162720.0

In [10]:
svi_quantile.to_csv("./data/CDC/svi_quantile.csv")

In [13]:
svi.head()

  ST_ABBR   COUNTY  E_TOTPOP  F_TOTAL
0      NY   Oneida      4432        2
1      NY   Oneida      2406        1
2      NY   Oneida      4498        0
3      NY   Oneida      3799        0
4      NY   Oneida      2298        0

In [14]:
svi.replace(-999, np.nan, inplace = True)

In [25]:
svi.drop(["M_TOTPOP","AREA_SQMI"], axis = 1, inplace = True)

In [15]:
svi.dropna(inplace = True)

In [16]:
svi.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 72382 entries, 0 to 72841
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ST_ABBR   72382 non-null  object
 1   COUNTY    72382 non-null  object
 2   E_TOTPOP  72382 non-null  int64
 3   F_TOTAL   72382 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.8+ MB

In [17]:
prod = svi["E_TOTPOP"] * svi["F_TOTAL"]

In [18]:
prod.head()

0    8864.0
1    2406.0
2       0.0
3       0.0
4       0.0
dtype: float64

In [19]:
svi["Product"] = prod

In [20]:
svi.head()

  ST_ABBR   COUNTY  E_TOTPOP  F_TOTAL  Product
0      NY   Oneida      4432      2.0   8864.0
1      NY   Oneida      2406      1.0   2406.0
2      NY   Oneida      4498      0.0      0.0
3      NY   Oneida      3799      0.0      0.0
4      NY   Oneida      2298      0.0      0.0

In [21]:
svi["COUNTY"] = svi["COUNTY"] + svi["ST_ABBR"]

In [28]:
svi.head()

      COUNTY  E_TOTPOP  F_TOTAL  Product
0   OneidaNY      4432      2.0   8864.0
1   OneidaNY      2406      1.0   2406.0
2   OneidaNY      4498      0.0      0.0
3   OneidaNY      3799      0.0      0.0
4   OneidaNY      2298      0.0      0.0

In [27]:
svi.drop(["ST_ABBR"], inplace = True, axis = 1)

In [29]:
svi = svi.groupby(["COUNTY"]).sum()

In [30]:
svi.head()

              E_TOTPOP  F_TOTAL   Product
COUNTY
 AbbevilleSC     25100     13.0   49679.0
 AcadiaLA        62031     21.0  110194.0
 AccomackVA      33162      9.0   45829.0
 AdaID          409239     31.0  197684.0
 AdairIA          7543      1.0    3012.0

In [31]:
svi.drop(["F_TOTAL"], axis = 1, inplace = True)

In [36]:
svi.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1851 entries,  Abbeville to Alameda
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   E_TOTPOP  1851 non-null   int64
 1   Product   1851 non-null   float64
dtypes: float64(1), int64(1)
memory usage: 107.9+ KB

In [32]:
svi.max()

E_TOTPOP     9974179.0
Product     30162720.0
dtype: float64

In [38]:
svi.min()

E_TOTPOP    73.0
Product      0.0
dtype: float64

In [33]:
svi.describe()

           E_TOTPOP       Product
count  3.142000e+03  3.142000e+03
mean   9.996977e+04  1.394773e+05
std    3.199211e+05  7.846648e+05
min    7.300000e+01  0.000000e+00
25%    1.102875e+04  7.206000e+03
50%    2.579850e+04  2.548300e+04
75%    6.710700e+04  6.850275e+04
max    9.974179e+06  3.016272e+07

In [34]:
svi.to_csv("./data/CDC/svi_cleaned_with_state.csv")